app/controllers/books_controller.rb

SELECT "books".* FROM "books" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "books"
---
	def index
		@books = Book.page(params[:page]).per(5)

INSERT INTO "books" ("author", "created_at", "description", "isbn", "name", "publisher", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@book = Book.new(params[:book])
		if @book.save

UPDATE "books" SET "description" = 'edit test.this is a nice book to read', "updated_at" = '2012-06-12 07:11:29.675053' WHERE "books"."id" = 1
---
	def update
		#@book = Book.find(params[:id])
		if @book.update_attributes(params[:book])