app/controllers/borrows_controller.rb

SELECT "borrows".* FROM "borrows"
SELECT "books".* FROM "books" INNER JOIN "borrows" ON "books"."id" = "borrows"."book_id" WHERE "borrows"."user_id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @borrows = Borrow.all
    @books = User.find(session[:current_user_id]).books

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "borrows" ("book_id", "borrowed_date", "created_at", "returned_date", "scheduled_return_date", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def new
    @book = Book.find(params[:book_id])
    user_id = session['current_user_id']
    @borrow = Borrow.create(:book_id => @book.id, :user_id => user_id)